Enhance README
